Revit 2018 API
BuiltInFailures.FabricationShapeFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.FabricationShapeFailures type exposes the following members.
Properties
Name | Description
FabricationShapeCannotGenerate
 Could not generate fabrication shape
FabricationShapeModelingError
 A modeling error occurred: this happens when a modifier failed to subtract from main body
See Also
BuiltInFailures.FabricationShapeFailures Class
Autodesk.Revit.DB Namespace